In [1]:
import numpy as np
import pandas as pd

# CSV 데이터 파일 읽어오기

In [2]:
train = pd.read_csv('data/train.csv',index_col='PassengerId')
train.shape

(891, 11)

## 데이터 프레임에서 앞과 뒤에 갯수 정해서 표시하기
```
데이터프레임명.head() 
데이터프레임명.tail() 
default 5개
```

In [3]:
train.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [4]:
train.tail()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
train.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
train.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [7]:
train['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [8]:
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [9]:
train[train['Pclass']==1].head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S

### 1등칸 객실 승객의 생존 리스트

In [10]:
train[(train['Pclass'] == 1) & (train['Survived']==1)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C

In [11]:
result = train[(train['Pclass'] == 1) & (train['Survived']==1)]
len(result)

136

In [12]:
len(train[(train['Pclass'] == 3) & (train['Survived']==1)])

119

In [13]:
len(train[(train['Pclass'] == 3) & (train['Survived']==1)  & (train['Sex']=='male')])

47

In [14]:
len(train[train['Survived']==1])

342

In [15]:
len(train)

891

In [16]:
(len(train[train['Survived']==1])/len(train))*100

38.38383838383838

In [17]:
round((len(train[train['Survived']==1])/len(train))*100,3)

38.384

In [18]:
ms = len(train[(train['Sex']=='male') & (train['Survived']==1)])
ms

109

In [19]:
fs = len(train[(train['Sex']=='female') & (train['Survived']==1)])
fs

233

In [20]:
len(train)

891

In [21]:
round(ms/len(train[(train['Sex']=='male')])*100,3)

18.891

In [22]:
round(fs/len(train[(train['Sex']=='female')])*100,3)

74.204

In [23]:
round(len(result)/len(train)*100,3)

15.264

# 결측값 nan확인하기

In [24]:
train['Age'].isnull().head()

PassengerId
1    False
2    False
3    False
4    False
5    False
Name: Age, dtype: bool

In [25]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
len(train[train['Age'].isnull()])

177

In [27]:
train[train['Age'].isnull()].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

In [28]:
#평균값
age_avr = train['Age'].mean()
age_avr = round(age_avr,2)
age_avr

29.7

In [29]:
train.loc[train['Age'].isnull(),'Age'] = age_avr

In [30]:
len(train[train['Age'].isnull()])

0

In [32]:
train[train['Age'] == 29.7].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0,3,"Moran, Mr. James",male,29.7,0,0,330877,8.4583,NaN,Q
18,1,2,"Williams, Mr. Charles Eugene",male,29.7,0,0,244373,13.0000,NaN,S
20,1,3,"Masselmani, Mrs. Fatima",female,29.7,0,0,2649,7.2250,NaN,C
27,0,3,"Emir, Mr. Farred Chehab",male,29.7,0,0,2631,7.2250,NaN,C
29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,29.7,0,0,330959,7.8792,NaN,Q

In [33]:
train.loc[train['Cabin'].isnull(),'Cabin'] = ''

In [34]:
train[train['Age'] == 29.7].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0,3,"Moran, Mr. James",male,29.7,0,0,330877,8.4583,,Q
18,1,2,"Williams, Mr. Charles Eugene",male,29.7,0,0,244373,13.0000,,S
20,1,3,"Masselmani, Mrs. Fatima",female,29.7,0,0,2649,7.2250,,C
27,0,3,"Emir, Mr. Farred Chehab",male,29.7,0,0,2631,7.2250,,C
29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,29.7,0,0,330959,7.8792,,Q

In [35]:
train.loc[train['Embarked'] == 'Q','Embarked'] = 'New Zealand'
train.loc[train['Embarked'] == 'S','Embarked'] = 'England'
train.loc[train['Embarked'] == 'C','Embarked'] = 'France'

In [36]:
train[train['Age'] == 29.7].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0,3,"Moran, Mr. James",male,29.7,0,0,330877,8.4583,,New Zealand
18,1,2,"Williams, Mr. Charles Eugene",male,29.7,0,0,244373,13.0000,,England
20,1,3,"Masselmani, Mrs. Fatima",female,29.7,0,0,2649,7.2250,,France
27,0,3,"Emir, Mr. Farred Chehab",male,29.7,0,0,2631,7.2250,,France
29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,29.7,0,0,330959,7.8792,,New Zealand